e2e/perf/cards-api.yml
---
config:
  environments:
    dev:
      target: "http://localhost:8000"
      phases:
        - name: Cards REST API performance tests
          duration: 3
          rampTo: 3
          arrivalRate: 1
    threads:
      target: "http://localhost:8000"
      phases:
        - name: Cards REST API Threads performance tests
          duration: 1
          arrivalCount: 1000

scenarios:
  - name: "Cards - Fetch All Cards in 1 Day"
    flow:
      - get:
          url: "/cards?mode=cache&day=30&environment=all&product=all&protocol=all"
          capture:
            - json: "$.cards.length"
              as: "cards_count"
          match:
            status: 200
      # - log: "Total number of cards: {{ cards_count }}"